{
  "news": [
    {
      "title": "Подборка книг по JavaScript для продвинутых разработчиков",
      "descripstion": "JavaScript — лидирующий в фронтенд-разработке язык программирования. Благодаря своим преимуществам он проник во многие области программирования: веб, кроссплатформенная мобильная разработка и даже десктопные приложения. Его основы несложно изучить, однако для написания качественного и высокопроизводительного кода необходимо знать большую часть его возможностей. Но изучение документации — процесс утомительный и малоэффективный.",
      "src": "https://cdn.tproger.ru/wp-content/uploads/2019/03/javascript-books.jpg",
      "likeCount": 9,
      "disLike": -5,
      "id": 1
    },
    {
      "title": "Сотрудники Google обнаружили, что работа над версией поисковика для Китая продолжается",
      "descripstion": "На Хабре публиковалось несколько новостей и статей о том, что Google планировал запустить версию своего поисковика для Китая в полном соответствии с нормами и законами этой страны. То есть это должна была быть «исправленная» версия поискового сервиса c цензурой. После того, как тысячи сотрудников интернет-компании выразили протест, а в корпорации возникли внутренние конфликты, руководство заявило о приостановке разработки Dragonfly (Google для Китая). Команды, которые были привлечены к решению этой задачи отозвали и направили на решение других вопросов. После этого все на какое-то время затихло. Но не все представители Google успокоились — нашлись те, кого не удовлетворило всеобщее молчание. Эта группа провела собственное расследование, обнаружив ряд интересных фактов. ",
      "src": "https://hsto.org/getpro/habr/post_images/088/f7e/b61/088f7eb618e50b97afff0691286cbcee.jpg",
      "likeCount": 5,
      "disLike": 0,
      "id": 2
    },
    {
      "id": 3,
      "title": "Машинное обучение в Додо. Как запустить новое направление, если ты разработчик",
      "descripstion": "Под катом история о том, как в Додо появилось направление машинного обучения. Спойлер: это я его запустил. Хардкорных технических подробностей тут не будет, обязательно посвящу им отдельную статью. Сегодня больше про мотивацию и поддержку коллег. Я сталкивался с темой машинного обучения трижды, пока из этого не получилось что-то стоящее.",
      "src": "https://hsto.org/webt/xx/lz/vh/xxlzvhhsgwbifo9tl1lpjsuwooa.png",
      "likeCount": 0,
      "disLike": 0
    },
    {
      "id": 4,
      "title": "Робот-гепард от MIT умеет делать сальто назад и быстро бегать",
      "descripstion": "Роботизированными животными сейчас никого не удивишь. Больше всех преуспели в создании четвероногих роботов разработчики из Boston Dynamics. Эта компания показывала и двуногих роботов, которые научились преодолевать препятствия, причем не только переступать через них, но даже перепрыгивать.  Но у Boston Dynamics есть конкуренты, в частности, разработчики из MIT. На днях они показали миниатюрного робота-гепарда (на настоящего гепарда он не очень похож), которого научили не только двигаться вперед, назад, боком, но и совершать сальто назад. Насколько известно, другие роботы (кроме игрушечных) такое делать не умеют. ",
      "src": "https://hsto.org/getpro/habr/post_images/0ee/3d4/d24/0ee3d4d2491cee9342e70092707a83cd.jpg",
      "likeCount": 0,
      "disLike": 0
    },
    {
      "title": "Команда Google Project Zero нашла серьезную уязвимость в ядре macOS",
      "descripstion": "Copy-on-write поведение работает не только с анонимной памятью, но и с отображениями файлов. Это значит, что после того, как целевой процесс начал чтение из перенесенной области памяти, изменение памяти может привести к удалению страниц, содержащих перенесенную память, из кэша. Позже, когда удаленные страницы снова понадобятся, они могут быть перезагружены из резервной файловой системы.Если злоумышленник может изменить файл на диске без уведомления подсистемы виртуального управления, то это ошибка безопасности. MacOS позволяет обычным пользователям монтировать образы файловой системы. Когда образ смонтированной файловой системы изменяется напрямую (например, путем вызова pwrite() для образа файловой системы), эта информация не будет передана в смонтированную файловую систему.",
      "src": "https://hsto.org/webt/hk/dp/gq/hkdpgqkwbvyrhxntkeokywdbw08.png",
      "likeCount": 5,
      "disLike": -5,
      "id": 5
    },
    {
      "id": 6,
      "title": "Как сообщили источники: cвернута спорная программа прослушки АНБ",
      "descripstion": "АНБ незаметно прикрыло систему, которая анализирует внутренних логи звонков и смс-ки американцев, и остановила программу, которая явилась началом бурных рассуждений о неприкосновенности частной жизни и верховенстве закона после печальных событий 11/09/2001.АНБ не использовало эту систему в течение нескольких месяцев, и администрация Трампа скорее всего не станет спрашивать Конгресс дать разрешение на продление этой программы, срок действия которой истекает в конце этого года. В грубом утверждении своей исполнительной власти, администрация президента Джорджа Буша-младшего запустила программу как часть своего интенсивного преследования заговорщиков Al-Qaeda (запрещенная в РФ организация), в течение нескольких недель после террористических атак 2001 года, и впоследствии суд тайно благословил ее. ",
      "src": "https://hsto.org/webt/ej/-l/b9/ej-lb90gefoczgnhe9ai4rae2g4.jpeg",
      "likeCount": 0,
      "disLike": 0
    },
    {
      "id": 7,
      "title": "Microsoft: Россия опережает США и Европу по внедрению искусственного интеллекта",
      "descripstion": "Директора российских предприятий заняли второе место по уровню положительного отношения к ИИ. Около 73% руководителей считают, что технология позитивно будет влиять на их управленческую деятельность. Директора отечественных компаний продемонстрировали более высокую готовность к обучению и развитию новых навыков в области ИИ. 90% выразили желание получить поддержку профессионалов для того, чтобы лучше и эффективнее работать с новой технологии. В среднем по миру этот показатель составляет 67,3%. Кроме того, 30% отечественных руководителей готовы выделять время для адаптации к новым условиям работы. В среднем по миру показатель ниже — 20,3%. Российские руководители компаний ответственно относятся к внедрению технологий. Более 65% считают, что ответственность за этику применения ИИ лежит на руководителе компании. Аналогичной точки зрения в мире придерживается 53,9%.",
      "src": "https://hsto.org/getpro/habr/post_images/abb/335/c85/abb335c852647b70f297456823c32dcf.jpg",
      "likeCount": 0,
      "disLike": 0
    },
    {
      "id": 8,
      "title": "SmartMail Conf: первая конференция Почты Mail.ru по машинному обучению",
      "descripstion": "23 марта в нашем офисе пройдет первая профессиональная конференция от разработчиков Почты Mail.ru — SmartMail Conf. Она будет посвящена использованию технологий машинного обучения в высоконагруженных сервисах. Машинное обучение — одно из приоритетных для нас направлений, и используется, например, в Почте Mail.ru для классификации писем, защиты от спама, сортировки рассылок, выделения важных писем, в технологии Smart Reply и прочих задачах. В основную программу конференции войдут технические доклады команды разработчиков Почты Mail.ru по обработке естественного языка, компьютерному зрению и обучению моделей для борьбы со спамом. Важной темой конференции станет компьютерное зрение и способы его применения в различных сервисах: от распознавания достопримечательностей на изображениях в Облаке Mail.ru до обнаружения людей в видеопотоке, изучением которого занимается подразделение Mail.ru для бизнеса. ",
      "src": "https://hsto.org/getpro/habr/post_images/705/0db/0ee/7050db0eed5af7db46a26c18a8b12979.png",
      "likeCount": 0,
      "disLike": 0
    }
  ]
}